In [1]:
#Importing all the libraries for analysis


import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'/Users/vineetasinha/Documents/dataanalytics/tasks/Data-Immersion/Achievement4/Instacart_Basket_Analysis'

In [3]:
path

'/Users/vineetasinha/Documents/dataanalytics/tasks/Data-Immersion/Achievement4/Instacart_Basket_Analysis'

In [4]:
df_cust= pd.read_csv(os.path.join(path,'02_Data','Original_Data','Customers.csv'))

In [5]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
df_cust.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

# 4. Wrangling data - renaming columns & dropping columns

In [7]:
df_customer=df_cust.rename(columns={'Surnam':'Last Name'})

In [8]:
df_customer.head(5)

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
df_customer=df_cust.rename(columns={'user_id':'User_id', 'STATE':'State', 'n_dependants':'Total_Dependants','fam_status':'Status', 'income':'Income'})

In [10]:
df_customer.head(5)

,User_id,First Name,Surnam,Gender,State,Age,date_joined,Total_Dependants,Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
#Renaming Columns

df_customer=df_cust.rename(columns={'user_id':'User_id', 'Surnam':'Last Name','STATE':'State', 'date_joined':'Joining_Date', 'n_dependants':'Total_Dependants','fam_status':'Status', 'income':'Income'})

In [12]:
df_customer.head(5)

,User_id,First Name,Last Name,Gender,State,Age,Joining_Date,Total_Dependants,Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#Dropping column Gender

df_customer=df_customer.drop(['Gender'],axis=1)

# Data Quality and Consistency check

In [14]:
df_customer.dtypes

User_id              int64
First Name          object
Last Name           object
State               object
Age                  int64
Joining_Date        object
Total_Dependants     int64
Status              object
Income               int64
dtype: object

In [15]:
df_customer.shape

(206209, 9)

In [16]:
df_customer['Income'].value_counts(dropna=False)

Income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

# Missing Values

In [17]:
df_customer.isnull().sum()

User_id                 0
First Name          11259
Last Name               0
State                   0
Age                     0
Joining_Date            0
Total_Dependants        0
Status                  0
Income                  0
dtype: int64

# First Name has a total of 11259 missing values

In [18]:
duplicate = df_customer[df_customer.duplicated(['User_id'])]

In [19]:
duplicate

Empty DataFrame
Columns: [User_id, First Name, Last Name, State, Age, Joining_Date, Total_Dependants, Status, Income]
Index: []

# No duplicate values found

In [20]:
df_missing_val=df_customer[df_customer['First Name'].isnull()==True]

In [21]:
df_missing_val

,User_id,First Name,Last Name,State,Age,Joining_Date,Total_Dependants,Status,Income
53,76659,NaN,Gilbert,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Colorado,23,4/1/2020,2,married,59222

# Checking for mixed datatypes - First name has mixed datatype as it contains missing values - no action is required as the other columns has unique data.

In [22]:
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].map(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

First Name

In [23]:
df_customer['Status'].value_counts(dropna=False)

Status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [24]:
df_customer['State'].value_counts(dropna=False)

State
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

# Combining Customer Data with the prepared Instacart data

In [25]:
df_ords_prods = pd.read_pickle(os.path.join(path,'02_Data','Prepared_Data','Ord_Prod_latest1.pkl'))

In [26]:
df_ords_prods.shape

(1000000, 26)

In [27]:
df_customer.shape

(206209, 9)

In [28]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 26 columns):
 #   Column                     Non-Null Count    Dtype
---  ------                     --------------    -----
 0   Unnamed: 0                 1000000 non-null  int64
 1   product_id                 1000000 non-null  int64
 2   product_name               1000000 non-null  object
 3   aisle_id                   1000000 non-null  int64
 4   department_id              1000000 non-null  int64
 5   prices                     1000000 non-null  float64
 6   order_id                   1000000 non-null  int64
 7   user_id                    1000000 non-null  int64
 8   eval_set                   1000000 non-null  object
 9   order_number               1000000 non-null  int64
 10  order_dow                  1000000 non-null  int64
 11  order_hour_of_day          1000000 non-null  int64
 12  days_since_prior_order     933795 non-null   float64
 13  add_to_cart_order          1000000 non-null  int64
 14  reordered                  1000000 non-null  int64
 15  _merge                     1000000 non-null  category
 16  price_range_loc            1000000 non-null  object
 17  Busiest Day                1000000 non-null  object
 18  Busiest & Slowest Days     1000000 non-null  object
 19  Busiest Period of the Day  1000000 non-null  object
 20  max_order                  1000000 non-null  int64
 21  loyalty_flag               1000000 non-null  object
 22  Average Price/order        1000000 non-null  float64
 23  Spending_Flag              1000000 non-null  object
 24  Regularity                 991808 non-null   float64
 25  Order_Frequency_Flag       1000000 non-null  object
dtypes: category(1), float64(4), int64(12), object(9)
memory usage: 191.7+ MB

In [29]:
df_ords_prods=df_ords_prods.drop(['eval_set'],axis=1)

In [30]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 25 columns):
 #   Column                     Non-Null Count    Dtype
---  ------                     --------------    -----
 0   Unnamed: 0                 1000000 non-null  int64
 1   product_id                 1000000 non-null  int64
 2   product_name               1000000 non-null  object
 3   aisle_id                   1000000 non-null  int64
 4   department_id              1000000 non-null  int64
 5   prices                     1000000 non-null  float64
 6   order_id                   1000000 non-null  int64
 7   user_id                    1000000 non-null  int64
 8   order_number               1000000 non-null  int64
 9   order_dow                  1000000 non-null  int64
 10  order_hour_of_day          1000000 non-null  int64
 11  days_since_prior_order     933795 non-null   float64
 12  add_to_cart_order          1000000 non-null  int64
 13  reordered                  1000000 non-null  int64
 14  _merge                     1000000 non-null  category
 15  price_range_loc            1000000 non-null  object
 16  Busiest Day                1000000 non-null  object
 17  Busiest & Slowest Days     1000000 non-null  object
 18  Busiest Period of the Day  1000000 non-null  object
 19  max_order                  1000000 non-null  int64
 20  loyalty_flag               1000000 non-null  object
 21  Average Price/order        1000000 non-null  float64
 22  Spending_Flag              1000000 non-null  object
 23  Regularity                 991808 non-null   float64
 24  Order_Frequency_Flag       1000000 non-null  object
dtypes: category(1), float64(4), int64(12), object(8)
memory usage: 184.1+ MB

In [31]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   User_id           206209 non-null  int64
 1   First Name        194950 non-null  object
 2   Last Name         206209 non-null  object
 3   State             206209 non-null  object
 4   Age               206209 non-null  int64
 5   Joining_Date      206209 non-null  object
 6   Total_Dependants  206209 non-null  int64
 7   Status            206209 non-null  object
 8   Income            206209 non-null  int64
dtypes: int64(4), object(5)
memory usage: 14.2+ MB

# Merging the two dataframes - customer & ords_prods

In [32]:
df_ords_prods=df_ords_prods.rename(columns={'user_id':'User_id'})

In [33]:
df_ords_prods.shape

(1000000, 25)

In [34]:
df_merged_cust_ordprod = df_ords_prods.merge(df_customer, on=['User_id'], indicator='exists')

In [35]:
df_merged_cust_ordprod.shape

(1000000, 34)

In [36]:
df_merged_cust_ordprod.to_pickle(os.path.join(path,'02_Data','Prepared_Data','Cust_ord_prod.pkl'))